/*
	2019年2月11日15:45:41
	功能：测试for的嵌套。
*/
#include <stdio.h>

int main (void)
{
	int i,j;
	
	for (i=0;i<3;++i)
	{
		printf("111!\n");
		for (j=2;j<5;++j)
		{
			printf("222!\n");
			printf("333!\n");
		}
		printf("444!\n");
	}


	return 0;
}
/*在vc6++中的结果为：
--------------------
111!
222!
333!
222!
333!
222!
333!这组三次是因为j=234的时候
444!
这组三次是因为i=012的时候
111!
222!
333!
222!
333!
222!
333!
444!

111!
222!
333!
222!
333!
222!
333!
444!
Press any key to continue
--------------------
原理：就是先执行下面的for再次执行上面的for。
*/